from dash import html


def new_features():
    return html.Div([
        html.H2("Доступ без пароля"),
        html.Small("10/06/2025", className="text-muted"),
        html.P("Временно доступ в сервис открыт без подтверждения по почте"),
        html.Hr(),
        html.H2("Длительные отметки занятости"),
        html.Small("08/06/2025", className="text-muted"),
        html.P("Отметки занятости аудиторий теперь могут сохраяться на срок от 1 до 4 пар."),
        html.P([
            "Отметки всё ещё могут добавлять и убирать все пользователи сервиса,",
            "но теперь можно выбрать, на сколько пар вы хотите оставить отметку.",
            "Если отметка пересекается с занятием, то отметка удаляется автоматически.",
        ]),
        html.Hr(),
        html.H2("Прямые сслыки на аудитории"),
        html.Small("07/06/2025", className="text-muted"),
        html.P("По ГК были развешаны QR-коды, которые позволяют забронировать аудиторию в 2 клика."),
        html.P([
            "В дальнейшем планируется добавить возможность создавать ссылки пользователям,",
            "а также использовать альтернативные способы быстро перейти к бронированию.",
            "Предложения по оформлению табличек и QR-кодов можно присылать администратору сервиса: ",
            html.A("Folegle", href="tg://resolve?domain=folegle&text=Привет! Я хочу предложить улучшения для Roomba:")
        ]),
        html.Hr(),
        html.H2("Частичныые графики занятости"),
        html.Small("24/01/2025", className="text-muted"),
        html.P("Графики занятости теперь отображаются частично"),
        html.P([
            "Стандартное отображение — график для ",
            html.Span("Главного корпуса", style={"color": "#00A19A", "font-weight": "800"}),
            ", но можно выбрать любой другой корпус или все сразу. Так мы хотим улучшить доступность страницы для пользователей с менее мощными устройствами, а также снизить нагрузку на сервер."
        ]),
        html.Hr(),
        html.H2("Поиск аудиторий по оборудованию"),
        html.Small("22/01/2025", className="text-muted"),
        html.P("Добавлен подбор свободных аудиторий по размеру и оборудованию."),
        html.P("Теперь организаторы мероприятий легче смогут найти аудиторию по своим запросам и предпочтениям"),
        html.Hr(),
        html.Div([
            html.H2("Редактирование занятости", style={"color": "var(--color-primary)"}),
            html.Small("21/01/2025", className="text-muted"),
            html.P("Добавлена возможность редактировать занятость аудиторий, эксклюзивная для Учебного Управления"),
        ], style={"background-color": "lightgray", "padding": "0.5rem"}),
        html.Hr(),
        html.H2("Расписание сессии"),
        html.Small("26/12/2024", className="text-muted"),
        html.P("Из базы данных было убрано расписание семестра и заменено на расписание экзаменов. Теперь можно найти свой экзамен как ранее занятие и не занимать кабинеты, взятые под экзамены."),
        html.Hr(),
        html.H2("Поиск по аббревиатурам"),
        html.Small("09/12/2024", className="text-muted"),
        html.P("Теперь поиск учитывает возможные аббревиатуры названий пары. Работает только если перед названием нет имени преподавателя."),
        html.Hr(),
        html.H2("Отметки для аудиторий"),
        html.Small("07/12/2024", className="text-muted"),
        html.P("Добавлено новое окно для отслеживания текущей занятости аудиторий."),
        html.P(" ".join([
            "Теперь можно проверить наглядно какие аудитории сейчас свободны,",
            "а также отметить своё присутствие в аудитории, чтобы другие видели, что она занята.",
            "Данные о занятости деражатся до конца очередной пары, так что не забывайте продлевать",
            "свою отметку если задерживаетесь. Отметки могут ставить и убирать любые пользователи сервиса",
            "поэтому просим вас быть внимательными и не злоупотреблять этой возможностью."
        ])),
        html.P(html.Em(" ".join([
            "Список аудиторий, которые можно отметить как занятую сейчас неоправданно широкий,",
            "и в ближайшее время мы будем уточнять категории комнат, открытого доступа в которые у студентов нет.",
            "Если у вас есть предложения по улучшению этой функции, пожалуйста, напишите нам."
        ]))),
        html.Hr(),
        html.H2("Сжатие заголовка"),
        html.Small("07/12/2024", className="text-muted"),
        html.P("Навигационная панель сайта теперь содержит ссылки на дргуие страницы и занимает меньше места."),
        html.P("Доступ к поиску, новым функциям и быстрая навигация наверх остаются доступными на всех страницах."),
        html.Hr(),
        html.H2("Оптимизация"),
        html.Small("01/12/2024", className="text-muted"),
        html.P("Графики кэшируются, меньше нагружая сервер"),
        html.P(" ".join([
            "Линия текущего времени не входит в кэширование, поэтому она осталась, но не обновляется автоматически."
            "По этой же причине страница теперь не обновляется автоматически.",
        ])),
        html.Hr(),
        html.H2("Вертикальная мобильность"),
        html.Small("29/11/2024", className="text-muted"),
        html.P("Добавлена возможность быстро перемещаться вверх и вниз к нужным разделам"),
        html.P([" ".join([
            "Для перехода к нужной секции наверху страницы добавлено меню «Перейти к» со",
            "ссылками на все разделы. Для возврата обратно наверх добавлена кнопка ",
        ]), html.I(className="bi bi-chevron-up")]),
        html.Hr(),
        html.H2("Свободные аудитории"),
        html.Small("25/11/2024", className="text-muted"),
        html.P("Добавлен раздел «Свободные аудитории»"),
        html.P("Зайти посмотреть можно по нажатию кнопки «Свободные аудитории» наверху страницы"),
        html.P(" ".join([
            "В открывшемся окне можно посмотреть свободные аудитории сейчас или в выбранное время",
            "для дня, выбранного в календаре в основном окне. Также можно отфильтровать аудитории по корпусу." 
        ])),
        html.P(html.Em([
            "Если аудитория занята учебным занятием, при том что она отображается как свободная, ",
            "напишите об этом на почту ",
            html.A("МКИ", href="mailto:mki@phystech.edu"),
            " или ", html.A("Folegle", href="tg://resolve?domain=folegle&text=Привет! Я нашёл несоответствие расписанию на сайте:")
        ])),
        html.Hr(),
        html.H2("Поиск по группе"),
        html.Small("28/11/2024", className="text-muted"),
        html.P("Поиск теперь поддерживает учебные группы"),
        html.P(" ".join([
            "Кроме занятий, которые проходят у указанной группы по расписанию,",
            "теперь в результатах также отображаются лекции, которые читаются",
            "для всего потока, к которой эта группа относится."
        ])),
        html.P(html.Em([
            "Если ваша группа не даёт ожидаемых результатов, сообщите об этом нам."
        ])),
        html.Hr(),
        html.H2("Расписание ДИЯ"),
        html.Small("25/11/2024", className="text-muted"),
        html.P("В расписание были добавлены аудитории ДИЯ"),
    ])